[
  { "term": "absolute path", "definition": "the path defined from the root of the system" },
  { "term": "add", "definition": "the step that stages/prepares files to be committed to a repository from a local branch" },
  { "term": "argument", "definition": "input to a command line program" },
  { "term": "bash", "definition": "bash or the bourne-again shell is the primary interface in UNIX based systems" },
  { "term": "bitwise operator", "definition": "an operation that happens on a bit string (sequence of 1s and 0s). They are typically faster than operations on whole integers." },
  { "term": "branch", "definition": "a copy of the main branch (typically) where developmental changes occur. The changes do not affect other branches because it is isolated from other branches." },
  { "term": "compiled code", "definition": "code that is put through a compiler to turn it into lower level assembly language before it is executed. must be compiled and re-executed every time you make a change." },
  { "term": "detached head", "definition": "a state of a git repo where the head pointer is set to a commit without a branch also pointing to the commit" },
  { "term": "directory", "definition": "a collection of files typically created for organizational purposes" },
  { "term": "divergent", "definition": "git branches that have diverged means that there are different commits that have the same parent; there are multiple ways that git could fix this, so you have to tell it what strategy to use" },
  { "term": "fixed point number", "definition": "the concept that the decimal point does not move in the number. Cannot represent as wide of a range of values as a floating point number." },
  { "term": "floating point number", "definition": "the concept that the decimal can move within the number (ex. scientific notation; you move the decimal based on the exponent on the 10). can represent more numbers than a fixed point number." },
  { "term": "git", "definition": "a version control tool; it’s a fully open source and always free tool, that can be hosted by anyone or used without a host, locally only." },
  { "term": "GitHub", "definition": "a hosting service for git repositories" },
  { "term": ".gitignore", "definition": "a file in a git repo that will not add the files that are included in this .gitignore file. Used to prevent files from being unnecessarily committed." },
  { "term": "git objects", "definition": "something (a file, directory) that is used in git; has a hash associated with it" },
  { "term": "git plumbing commands", "definition": "low level git commands that allow the user to access the inner workings of git." },
  { "term": "git workflow", "definition": "a recipe or recommendation for how to use Git to accomplish work in a consistent and productive manner" },
  { "term": "HEAD", "definition": "a file in the .git directory that indicates what is currently checked out (think of the current branch)" },
  { "term": "merge", "definition": "putting two branches together so that you can access files in another branch that are not available in yours" },
  { "term": "merge conflict", "definition": "when two branches to be merged edit the same lines and git cannot automatically merge the changes" },
  { "term": "mermaid", "definition": "mermaid syntax allows user to create precise, detailed diagrams in markdown files." },
  { "term": "hash function", "definition": "the actual function that does the hashing of the input (a key, an object, etc.)" },
  { "term": "hashing", "definition": "transforming an input of arbitrary length to a unique fixed length output (the output is called a hash; used in hash tables and when git hashes commits)." },
  { "term": "integrated development environment", "definition": "also known as an IDE, puts together all of the tools a developer would need to produce code... into one application so that everything can be done in one place." },
  { "term": "interpreted code", "definition": "code that is directly executed from a high level language. more expensive computationally because it cannot be optimized and therefore can be slower." },
  { "term": "issue", "definition": "provides the ability to easily track ideas, feedback, tasks, or bugs. branches can be created for specific issues." },
  { "term": "linker", "definition": "a program that links together the object files and libraries to output an executable file." },
  { "term": "option", "definition": "also known as a flag, a parameter to a command line program that changes its behavior, different from an argument" },
  { "term": "path", "definition": "the “location” of a file or folder(directory) in a computer" },
  { "term": "pointer", "definition": "a variable that stores the address of another variable" },
  { "term": "pull", "definition": "download changes from a remote repository and update the local repository with these changes." },
  { "term": "pull request", "definition": "allow other users to review and request changes on branches. after a pull request receives approval you can merge the changed content to the main branch." },
  { "term": "PR", "definition": "short for pull request" },
  { "term": "push", "definition": "to put whatever you were working on from your local machine onto a remote copy of the repository in a version control system." },
  { "term": "relative path", "definition": "the path defined relative to another file or the current working directory; may start with a name, includes a single file name or may start with ./" },
  { "term": "release", "definition": "a distribution of your code, related to a git tag" },
  { "term": "remote", "definition": "a copy of the repository hosted on a server" },
  { "term": "repository", "definition": "a project folder with tracking information in it in the form of a .git directory in it" },
  { "term": "ROM (Read-Only Memory)", "definition": "Memory that only gets read by the CPU and is used for instructions" },
  { "term": "SHA 1", "definition": "the hashing function that git uses to hash its functions (found to have very serious collisions, so a lot of software is switching to SHA 256)" },
  { "term": "sh", "definition": "abbr. see shell" },
  { "term": "shell", "definition": "a command line interface; allows for access to an operating system" },
  { "term": "ssh", "definition": "allows computers to safely connect to networks (such as when we used an ssh key to clone our github repos)" },
  { "term": "templating", "definition": "templating is the idea of changing the input or output of a system... displays them as HTML pages (with the contents of the markdown file)." },
  { "term": "terminal", "definition": "a program that makes shell visible for us and allows for interactions with it" },
  { "term": "tree objects", "definition": "type of git object in git that helps store multiple files with their hashes (similar to directories in a file system)" },
  { "term": "yml", "definition": "see YAML" },
  { "term": "YAML", "definition": "a file specification that stores key-value pairs. It is commonly used for configurations and settings." },
  { "term": "zsh", "definition": "zsh or z shell is built on top of the bash shell and contains new features" }
]
